**FREE
DCL-S a INT(10);
DCL-S b INT(10);
DCL-S result INT(10);
a = 10;
b = 3;
result = a + b;
DSPLY %CHAR(result);
result = a - b;
DSPLY %CHAR(result);
result = a * b;
DSPLY %CHAR(result);
result = a / b;
DSPLY %CHAR(result);
result = (a + b) * 2;
DSPLY %CHAR(result);
*INLR = *ON;
